; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-2-4-6)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-2 - location
	p1-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s0)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at package1 s0)
	(at package2 s0)
	(at package3 s2)
	(at package4 s1)
	(at package5 s2)
	(at package6 s0)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 18)
	(= (time-to-walk p0-2 s0) 18)
	(= (time-to-walk s2 p0-2) 27)
	(= (time-to-walk p0-2 s2) 27)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 55)
	(= (time-to-walk p1-0 s1) 55)
	(= (time-to-walk s0 p1-0) 9)
	(= (time-to-walk p1-0 s0) 9)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 3)
	(= (time-to-walk p2-1 s2) 3)
	(= (time-to-walk s1 p2-1) 89)
	(= (time-to-walk p2-1 s1) 89)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 86)
	(= (time-to-drive s1 s0) 86)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 26)
	(= (time-to-drive s2 s0) 26)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 19)
	(= (time-to-drive s1 s2) 19)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s0)
	(at truck1 s1)
	(at truck2 s1)
	(at truck3 s0)
	(at package1 s1)
	(at package2 s1)
	(at package3 s2)
	(at package4 s0)
	(at package5 s0)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 3  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver1 truck3 s0)
   deleted: (at driver1 s0) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 2 of 9
2. (load-truck package2 truck3 s0)
   deleted: (at package2 s0)
   added: (in package2 truck3)
   goals met: 2 of 9
3. (load-truck package1 truck3 s0)
   deleted: (at package1 s0)
   added: (in package1 truck3)
   goals met: 2 of 9
4. (drive-truck truck3 s0 s1 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (driven) from 0 to 86
   goals met: 1 of 9
5. (unload-truck package1 truck3 s1)
   deleted: (in package1 truck3)
   added: (at package1 s1)
   goals met: 2 of 9
6. (drive-truck truck3 s1 s0 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (driven) from 86 to 172
   goals met: 3 of 9
7. (disembark-truck driver1 truck3 s0)
   deleted: (driving driver1 truck3)
   added: (at driver1 s0) (empty truck3)
   goals met: 4 of 9
8. (walk driver1 s0 p0-2)
   deleted: (at driver1 s0)
   added: (at driver1 p0-2)
   changed: (walked) from 0 to 18
   goals met: 3 of 9
9. (load-truck package5 truck1 s2)
   deleted: (at package5 s2)
   added: (in package5 truck1)
   goals met: 3 of 9
10. (walk driver1 p0-2 s0)
   deleted: (at driver1 p0-2)
   added: (at driver1 s0)
   changed: (walked) from 18 to 36
   goals met: 4 of 9
11. (board-truck driver1 truck3 s0)
   deleted: (at driver1 s0) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 3 of 9
12. (drive-truck truck3 s0 s2 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (driven) from 172 to 198
   goals met: 2 of 9
13. (disembark-truck driver1 truck3 s2)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 2 of 9
14. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 2 of 9
15. (unload-truck package2 truck3 s2)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   goals met: 2 of 9
16. (load-truck package2 truck2 s2)
   deleted: (at package2 s2)
   added: (in package2 truck2)
   goals met: 2 of 9
17. (drive-truck truck2 s2 s1 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (driven) from 198 to 217
   goals met: 3 of 9
18. (walk driver2 s0 p0-2)
   deleted: (at driver2 s0)
   added: (at driver2 p0-2)
   changed: (walked) from 36 to 54
   goals met: 3 of 9
19. (drive-truck truck2 s1 s2 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (driven) from 217 to 236
   goals met: 2 of 9
20. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 2 of 9
21. (unload-truck package5 truck1 s2)
   deleted: (in package5 truck1)
   added: (at package5 s2)
   goals met: 2 of 9
22. (load-truck package5 truck2 s2)
   deleted: (at package5 s2)
   added: (in package5 truck2)
   goals met: 2 of 9
23. (walk driver1 s2 p0-2)
   deleted: (at driver1 s2)
   added: (at driver1 p0-2)
   changed: (walked) from 54 to 81
   goals met: 2 of 9
24. (unload-truck package2 truck2 s2)
   deleted: (in package2 truck2)
   added: (at package2 s2)
   goals met: 2 of 9
25. (load-truck package2 truck3 s2)
   deleted: (at package2 s2)
   added: (in package2 truck3)
   goals met: 2 of 9
26. (walk driver1 p0-2 s0)
   deleted: (at driver1 p0-2)
   added: (at driver1 s0)
   changed: (walked) from 81 to 99
   goals met: 3 of 9
27. (load-truck package4 truck4 s1)
   deleted: (at package4 s1)
   added: (in package4 truck4)
   goals met: 3 of 9
28. (walk driver2 p0-2 s2)
   deleted: (at driver2 p0-2)
   added: (at driver2 s2)
   changed: (walked) from 99 to 126
   goals met: 3 of 9
29. (board-truck driver2 truck3 s2)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 3 of 9
30. (drive-truck truck3 s2 s1 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (driven) from 236 to 255
   goals met: 3 of 9
31. (unload-truck package2 truck3 s1)
   deleted: (in package2 truck3)
   added: (at package2 s1)
   goals met: 4 of 9
32. (unload-truck package5 truck2 s2)
   deleted: (in package5 truck2)
   added: (at package5 s2)
   goals met: 4 of 9
33. (drive-truck truck3 s1 s0 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (driven) from 255 to 341
   goals met: 5 of 9
34. (walk driver1 s0 p0-2)
   deleted: (at driver1 s0)
   added: (at driver1 p0-2)
   changed: (walked) from 126 to 144
   goals met: 4 of 9
35. (walk driver1 p0-2 s2)
   deleted: (at driver1 p0-2)
   added: (at driver1 s2)
   changed: (walked) from 144 to 171
   goals met: 4 of 9
36. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 4 of 9
37. (drive-truck truck2 s2 s0 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (driven) from 341 to 367
   goals met: 4 of 9
38. (disembark-truck driver1 truck2 s0)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 5 of 9
39. (walk driver1 s0 p0-2)
   deleted: (at driver1 s0)
   added: (at driver1 p0-2)
   changed: (walked) from 171 to 189
   goals met: 4 of 9
40. (disembark-truck driver2 truck3 s0)
   deleted: (driving driver2 truck3)
   added: (at driver2 s0) (empty truck3)
   goals met: 4 of 9
41. (walk driver1 p0-2 s0)
   deleted: (at driver1 p0-2)
   added: (at driver1 s0)
   changed: (walked) from 189 to 207
   goals met: 5 of 9
42. (board-truck driver1 truck2 s0)
   deleted: (at driver1 s0) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 4 of 9
43. (drive-truck truck2 s0 s2 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (driven) from 367 to 393
   goals met: 4 of 9
44. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 4 of 9
45. (walk driver1 s2 p0-2)
   deleted: (at driver1 s2)
   added: (at driver1 p0-2)
   changed: (walked) from 207 to 234
   goals met: 4 of 9
46. (walk driver1 p0-2 s0)
   deleted: (at driver1 p0-2)
   added: (at driver1 s0)
   changed: (walked) from 234 to 252
   goals met: 5 of 9
47. (board-truck driver1 truck3 s0)
   deleted: (at driver1 s0) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 4 of 9
48. (drive-truck truck3 s0 s2 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (driven) from 393 to 419
   goals met: 3 of 9
49. (disembark-truck driver1 truck3 s2)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 3 of 9
50. (walk driver1 s2 p0-2)
   deleted: (at driver1 s2)
   added: (at driver1 p0-2)
   changed: (walked) from 252 to 279
   goals met: 3 of 9
51. (walk driver1 p0-2 s0)
   deleted: (at driver1 p0-2)
   added: (at driver1 s0)
   changed: (walked) from 279 to 297
   goals met: 4 of 9
52. (walk driver1 s0 p1-0)
   deleted: (at driver1 s0)
   added: (at driver1 p1-0)
   changed: (walked) from 297 to 306
   goals met: 3 of 9
53. (walk driver2 s0 p0-2)
   deleted: (at driver2 s0)
   added: (at driver2 p0-2)
   changed: (walked) from 306 to 324
   goals met: 3 of 9
54. (walk driver1 p1-0 s1)
   deleted: (at driver1 p1-0)
   added: (at driver1 s1)
   changed: (walked) from 324 to 379
   goals met: 3 of 9
55. (walk driver2 p0-2 s2)
   deleted: (at driver2 p0-2)
   added: (at driver2 s2)
   changed: (walked) from 379 to 406
   goals met: 3 of 9
56. (board-truck driver2 truck3 s2)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 3 of 9
57. (unload-truck package4 truck4 s1)
   deleted: (in package4 truck4)
   added: (at package4 s1)
   goals met: 3 of 9
58. (drive-truck truck3 s2 s1 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (driven) from 419 to 438
   goals met: 3 of 9
59. (load-truck package4 truck3 s1)
   deleted: (at package4 s1)
   added: (in package4 truck3)
   goals met: 3 of 9
60. (walk driver1 s1 p2-1)
   deleted: (at driver1 s1)
   added: (at driver1 p2-1)
   changed: (walked) from 406 to 495
   goals met: 3 of 9
61. (drive-truck truck3 s1 s2 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (driven) from 438 to 457
   goals met: 3 of 9
62. (disembark-truck driver2 truck3 s2)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 3 of 9
63. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 3 of 9
64. (unload-truck package4 truck3 s2)
   deleted: (in package4 truck3)
   added: (at package4 s2)
   goals met: 3 of 9
65. (drive-truck truck1 s2 s1 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (driven) from 457 to 476
   goals met: 4 of 9
66. (disembark-truck driver2 truck1 s1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 4 of 9
67. (walk driver1 p2-1 s2)
   deleted: (at driver1 p2-1)
   added: (at driver1 s2)
   changed: (walked) from 495 to 498
   goals met: 4 of 9
68. (board-truck driver1 truck3 s2)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 4 of 9
69. (load-truck package4 truck3 s2)
   deleted: (at package4 s2)
   added: (in package4 truck3)
   goals met: 4 of 9
70. (load-truck package5 truck3 s2)
   deleted: (at package5 s2)
   added: (in package5 truck3)
   goals met: 4 of 9
71. (drive-truck truck3 s2 s0 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (driven) from 476 to 502
   goals met: 5 of 9
72. (unload-truck package4 truck3 s0)
   deleted: (in package4 truck3)
   added: (at package4 s0)
   goals met: 6 of 9
73. (walk driver2 s1 p2-1)
   deleted: (at driver2 s1)
   added: (at driver2 p2-1)
   changed: (walked) from 498 to 587
   goals met: 6 of 9
74. (unload-truck package5 truck3 s0)
   deleted: (in package5 truck3)
   added: (at package5 s0)
   goals met: 7 of 9
75. (disembark-truck driver1 truck3 s0)
   deleted: (driving driver1 truck3)
   added: (at driver1 s0) (empty truck3)
   goals met: 8 of 9
76. (walk driver2 p2-1 s2)
   deleted: (at driver2 p2-1)
   added: (at driver2 s2)
   changed: (walked) from 587 to 590
   goals met: 8 of 9
77. (board-truck driver2 truck2 s2)
   deleted: (at driver2 s2) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 8 of 9
78. (drive-truck truck2 s2 s1 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (driven) from 502 to 521
   goals met: 9 of 9
